#menu
global_menu_new=Create new {0}
global_menu_list=List all {0}
global_menu_find=Find by {0}
global_language_switch=Switch language to {0}
global_language=Language
global_sponsored=Sponsored by SpringSource
global_theme=Theme
global_theme_alt=alt
global_theme_standard=standard
global_generic={0}

#welcome page
welcome_titlepane=Welcome to {0}
welcome_h3=Welcome to {0}
welcome_text=Spring Roo provides interactive, lightweight and user customizable tooling that enables rapid delivery of high performance enterprise Java applications.

#entity labels
entity_list_all=List all {0}
entity_show=Show {0}
entity_create=Create new {0}
entity_update=Update {0}
entity_delete=Delete {0}
entity_delete_confirm=Are you sure want to delete this item?
entity_find=Find {0}
entity_not_found=No {0} found.
entity_not_found_single=No {0} found with this id.
entity_dependency_required=The following dependencies need to be created first:
entity_reference_not_managed=This relationship is managed from the {0} side.

#button labels
button_home=Home
button_save=Save
button_update=Update
button_find=Find
button_cancel=Cancel
button_proceed=Proceed
button_submit=Submit
button_reset=Reset
button_end=End
button_showmessage=Show Message
button_showstacktrace=Show Stack Trace
button_showcookie=Show Cookie

#field labels
field_simple_validation=Enter {0} {1}
field_invalid_email=Please enter a valid email
field_invalid_number=Number with \\'-\\' or \\'.\\' allowed
field_invalid_integer=Integer numbers only
field_invalid=Please enter valid {0}
field_required=required

#list labels
list_first=First Page
list_next=Next Page
list_previous=Previous Page
list_last=Last Page
list_page=Page {0} of {1}
list_size=List results per page:

#selenium
selenium_menu_test_suite=Test Suite

#exception
exception_message=Exception Message
exception_stacktrace=Exception Stack Trace
exception_cookie=Cookies
exception_details=Details
exception_login=Username or password wrong!

#dataAccessFailure_jspx
error_dataaccessfailure_title=Data access failure
error_dataaccessfailure_problemdescription=Sorry, a problem occurred while accessing the database.

#resourceNotFound_jspx
error_resourcenotfound_title=Requested Resource Not Found
error_resourcenotfound_problemdescription=Sorry, we did not find the resource you were looking for.

#uncaughtException_jspx
error_uncaughtexception_title=Internal Error
error_uncaughtexception_problemdescription=Sorry, we encountered an internal error.

#webflow
webflow_menu_enter=Enter {0} flow
webflow_state1_title=Spring Web Flow - View State One
webflow_state1_message=This is a simple example to get started with Spring Web Flow. The buttons below lead you to another view state (Proceed) or to an end state.
webflow_state2_title=Spring Web Flow - View State Two
webflow_state2_message=This is a simple example to get started with Spring Web Flow. The buttons below lead you to another view state (Proceed) or to an end state.
webflow_endstate_title=Spring Web Flow - End State
webflow_endstate_message=You have now reached the end of this flow.

#security
security_login_title=Spring Security Login
security_login_message=You have tried to access a protected area of this application. By default you can login as "admin", with a password of "admin".
security_login_form_name=Name
security_login_form_name_message=Enter your name
security_login_form_password=Password
security_login_form_password_message=Enter your password
security_login_unsuccessful=Your login attempt was not successful, try again. Reason: 
security_logout=Logout

#generate_certificate
generate_certificate_desc=<h1>\u6377\u800C\u601DCA\u6191\u8B49\u7533\u8ACB\u540C\u610F\u66F8</h1><p>\u8332\u56E0\u672C\u4EBA\u4F7F\u7528\u6377\u800C\u601DCA\u6191\u8B49\uFF0C\u65BC\u7DB2\u969B\u7DB2\u8DEF\u96FB\u5B50\u5F0F\u4EA4\u6613\u8A2D\u5099\u8CB7\u8CE3\u91D1\u878D\u5546\u54C1\u4E8B\u5B9C\uFF0C\u8B39\u4F9D\u64DA\u53F0\u7063\u8B49\u5238\u4EA4\u6613\u6240\u71DF\u696D\u7D30\u5247\u7B2C\u4E03\u5341\u4E94\u689D\u7B2C\u4E00\u9805\u7B2C\u4E5D\u6B3E\uFF0C\u540C\u610F\u4E26\u9075\u5B88\u4E0B\u5217\u4E8B\u9805\uFF1A</p><p>\u4E00\u3001\u672C\u4EBA\u540C\u610F\u914D\u5408\u8FA6\u7406\u6377\u800C\u601DCA\u6191\u8B49\u9032\u884C\u7DB2\u8DEF\u4E0B\u55AE\u4F5C\u696D\uFF0C\u4E26\u9075\u5B88\u524D\u5DF2\u7C3D\u5B9A\u4E4B\u300E\u8B49\u5238\u5546\u96FB\u5B50\u5F0F\u4EA4\u6613\u5E33\u6236\u59D4\u8A17\u8CB7\u8CE3\u6709\u50F9\u8B49\u5238\u540C\u610F\u66F8\u300F\u3001\u300E\u96FB\u5B50\u4EA4\u6613\u59D4\u8A17\u98A8\u96AA\u9810\u544A\u66C1\u540C\u610F\u66F8\u300F\u3002</p><p>\u4E8C\u3001\u672C\u4EBA\u540C\u610F\u4F7F\u7528\u6377\u800C\u601D\u7DB2\u8DEF\u4E0B\u55AE\u8A8D\u8B49\u7CFB\u7D71\uFF0C\u4E26\u63A1\u7528\u4E2D\u83EF\u96FB\u4FE1\u80A1\u4EFD\u6709\u9650\u516C\u53F8\u6240\u63D0\u4F9B\u4E4B\u8A8D\u8B49\u6A5F\u5236\u3002</p><p>\u4E09\u3001\u672C\u4EBA\u70BA\u672CCA\u6191\u8B49\u4E4B\u552F\u4E00\u6388\u6B0A\u4F7F\u7528\u8005\uFF0C\u540C\u610F\u5728\u7C3D\u7F72CA\u6191\u8B49\u7533\u8ACB\u540C\u610F\u66F8\u5F8C\uFF0C\u5118\u901F\u5B8C\u6210CA\u6191\u8B49\u7684\u4E0B\u8F09\uFF0C\u4E26\u59A5\u70BA\u4FDD\u7BA1CA\u6191\u8B49\u5E33\u865F\u53CA\u5BC6\u78BC\u3002\u82E5CA\u6191\u8B49\u906D\u672C\u4EBA\u4EE5\u5916\u4E4B\u4EBA\u7372\u6089\u3001\u5360\u6709\u6216\u767C\u751F\u907A\u5931\u76DC\u7528\u7B49\u60C5\u4E8B\uFF0C\u672C\u4EBA\u61C9\u7ACB\u5373\u901A\u77E5\u6377\u800C\u601D\u8655\u7406\u3002\u5728\u672A\u7372\u6377\u800C\u601D\u53D7\u7406\u8B8A\u66F4\u6216\u9032\u884C\u76F8\u95DC\u8655\u7F6E\u524D\u6240\u7522\u751F\u4E4B\u59D4\u8A17\u8CB7\u8CE3\uFF0C\u672C\u4EBA\u540C\u610F\u5C65\u884C\u4EA4\u5272\u7FA9\u52D9\u4E26\u8CA0\u5B8C\u5168\u8CAC\u4EFB\u3002</p><p>\u56DB\u3001\u672C\u4EBA\u660E\u767DCA\u6191\u8B49\u4FC2\u7531\u6377\u800C\u601D\u5411\u4E2D\u83EF\u96FB\u4FE1\u80A1\u4EFD\u6709\u9650\u516C\u53F8\u8A3B\u518A\u5F8C\u6240\u7C3D\u767C\u4E4B\u6191\u8B49\uFF0C\u5206\u70BA\u79C1\u9470\u53CA\u516C\u9470\uFF0C\u79C1\u9470\u9700\u7531\u7ACB\u66F8\u4EBA\u59A5\u5584\u4FDD\u7BA1\uFF0C\u56B4\u7981\u6D29\u6F0F\u65BC\u4ED6\u4EBA\uFF0C\u516C\u9470\u5247\u4F5C\u70BA\u6377\u800C\u601D\u9A57\u8B49\u79C1\u9470\u7684\u6191\u64DA\u3002\u9996\u6B21\u5411\u8A8D\u8B49\u6A5F\u69CB\u7533\u8ACB\u6838\u767C\u6191\u8B49\u6240\u767C\u751F\u4E4B\u8CBB\u7528\u7531\u6377\u800C\u601D\u8CA0\u64D4\uFF0C\u672C\u4EBA\u4E0D\u5FC5\u652F\u4ED8\u4EFB\u4F55\u8CBB\u7528\u3002</p><p>\u4E94\u3001CA\u6191\u8B49\u4FDD\u5B58\uFF1A\u672C\u4EBA\u6240\u6301\u6709\u4E4B\u79C1\u9470\uFF0C\u6377\u800C\u601D\u4E26\u7121\u5B58\u6709\u79C1\u9470\u6A94\u6848\uFF0C\u672C\u4EBA\u53D6\u5F97CA\u6191\u8B49\u5F8C\uFF0C\u5C07\u7ACB\u5373\u9032\u884C\u6191\u8B49\u5099\u4EFD\uFF0C\u4E26\u59A5\u5584\u4FDD\u5B58\u5099\u4EFD\u6191\u8B49\uFF0C\u4EE5\u9632\u79C1\u9470\u907A\u5931\u6642\uFF0C\u4ECD\u6709\u5099\u4EFD\u6191\u8B49\u53EF\u8CC7\u4F7F\u7528\u3002</p><p>\u516D\u3001CA\u6191\u8B49\u6709\u6548\u671F\u9593\uFF1A\u672C\u6191\u8B49\u6709\u6548\u4F7F\u7528\u6642\u9593\u81EA\u7533\u8ACB\u65E5\u8D77\u4E00\u5E74\u5167\u6709\u6548\u3002 \u5728CA\u6191\u8B49\u5230\u671F\u524D\uFF0C\u672C\u4EBA\u61C9\u4E3B\u52D5\u81F3\u6377\u800C\u601D\u96FB\u5B50\u4EA4\u6613\u5E73\u53F0\u8FA6\u7406\u6191\u8B49\u5C55\u671F\uFF0C\u6216\u81F3\u5206\u516C\u53F8\u91CD\u65B0\u8FA6\u7406\u6191\u8B49\uFF0C\u4EE5\u7DAD\u8B77\u672C\u4EBA\u7684\u4E0B\u55AE\u6B0A\u76CA\u3002</p><p>\u4E03\u3001CA\u6191\u8B49\u56E0\u6545\u88DC\u767C\uFF1A\u672C\u4EBA\u4E4BCA\u6191\u8B49\u82E5\u56E0\u6545\u640D\u6BC0\u6216\u906D\u672C\u4EBA\u4EE5\u5916\u4E4B\u4EBA\u7372\u6089\u3001\u5360\u6709\u6216\u767C\u751F\u907A\u5931\u76DC\u7528\u3001\u5BC6\u78BC\u907A\u5FD8\u7B49\u60C5\u4E8B\uFF0C\u61C9\u7ACB\u5373\u64A5\u96FB\u8A71\u81F3\u6377\u800C\u601D\u5BA2\u670D\u5C08\u7DDA\u6838\u5C0D\u8EAB\u4EFD\u5F8C\u8FA6\u7406\u6191\u8B49\u8A3B\u92B7\uFF0C\u6216\u81F3\u6377\u800C\u601D\u958B\u6236\u6AC3\u53F0\u8FA6\u7406\u6191\u8B49\u8A3B\u92B7\u4F5C\u696D\u3002</p><p>\u516B\u3001CA\u6191\u8B49\u7528\u9014\uFF1A\u4EE5\u6377\u800C\u601D\u53CA\u4E2D\u83EF\u96FB\u4FE1\u80A1\u4EFD\u6709\u9650\u516C\u53F8\u7DB2\u7AD9\u4E0A\u516C\u544A\u70BA\u4E3B\u3002</p><p>\u6B64\u81F4   \u6377\u800C\u601D\u80A1\u4EFD\u6709\u9650\u516C\u53F8</p>
generate_certificate_success=Apply certificate success, check the email for active certificate.
generate_certificate_fail=Apply certificate fail, check the cabinet file.
generate_certificate_from_ra_error=Apply certificate fail
active_certificate_success=Install certificate success.
active_certificate_fail=Install certificate fail.
active_certificate_from_ra_error=Certificate is not active.
active_certificate_already_exist=Certificate is already exist.
label_com_jrsys_foxitsign_entity_generate_certificate=Apply Certificate
label_com_jrsys_foxitsign_entity_active_certificate=Active Certificate

dashboard_title=\u65B0\u54C1\u4ECB\u7D39